Revit 2026 API

# ViewRestoreCalloutParent Method

---

Restores callout parent ID to the original view ID if that view is still available.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RestoreCalloutParent()
```
```vb
Public Sub RestoreCalloutParent
```
```cpp
public:
void RestoreCalloutParent()
```
```fsharp
member RestoreCalloutParent : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This view is not a callout. |

Nothing is done if the callout already has parent or if the original callout parent is deleted or is not parallel to the callout view.

#### Reference

View Class

Autodesk.Revit.DB Namespace